## 🏗️ Terraform Plan Summary

**Environment:** 🧪 `dev`

| Step | Status |
|------|:------:|
| 🖌 Format & Style | ✅ `success` |
| ⚙️ Initialization | ✅ `success` |
| 🤖 Validation | ✅ `success` |
| 📖 Plan | ✅ `success` |

<details><summary>Plan Output</summary>

```terraform
data.terraform_remote_state.main: Reading...
random_id.bucket_suffix: Refreshing state... [id=usTc4Q]
google_vertex_ai_reasoning_engine.memory_bank: Refreshing state... [id=projects/doug-hayden-eng-sandbox/locations/us-central1/reasoningEngines/7754108392553054208]
google_service_account.app: Refreshing state... [id=projects/doug-hayden-eng-sandbox/serviceAccounts/agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_storage_bucket.artifact_service: Refreshing state... [id=agent-foundation-dev-artifact-service-bac4dce1]
google_sql_database_instance.sessions: Refreshing state... [id=agent-foundation-dev-sessions]
data.terraform_remote_state.main: Read complete after 0s
google_project_iam_member.app["roles/aiplatform.user"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/aiplatform.user/serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/telemetry.tracesWriter"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/telemetry.tracesWriter/serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/storage.objectUser"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/storage.objectUser/serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/storage.bucketViewer"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/storage.bucketViewer/serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/cloudsql.client"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/cloudsql.client/serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/serviceusage.serviceUsageConsumer"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/serviceusage.serviceUsageConsumer/serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/logging.logWriter"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/logging.logWriter/serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/cloudsql.instanceUser"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/cloudsql.instanceUser/serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/cloudtrace.agent"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/cloudtrace.agent/serviceAccount:agent-foundation-dev@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_sql_database.sessions: Refreshing state... [id=projects/doug-hayden-eng-sandbox/instances/agent-foundation-dev-sessions/databases/agent_sessions]
google_sql_user.app: Refreshing state... [id=agent-foundation-dev@doug-hayden-eng-sandbox.iam//agent-foundation-dev-sessions]
google_cloud_run_v2_service.app["us-central1"]: Refreshing state... [id=projects/doug-hayden-eng-sandbox/locations/us-central1/services/agent-foundation-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_cloud_run_v2_service.app["us-central1"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_cloud_run_v2_service" "app" {
      + annotations             = (known after apply)
      + binary_authorization    = (known after apply)
      + build_config            = (known after apply)
      + client                  = (known after apply)
      + client_version          = (known after apply)
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + custom_audiences        = (known after apply)
      + default_uri_disabled    = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = (known after apply)
      + description             = (known after apply)
      + effective_annotations   = (known after apply)
      + effective_labels        = (known after apply)
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + iap_enabled             = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + invoker_iam_disabled    = (known after apply)
      + labels                  = (known after apply)
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "us-central1"
      + multi_region_settings   = (known after apply)
      + name                    = "agent-foundation-dev"
      + observed_generation     = (known after apply)
      + reconciling             = (known after apply)
      + scaling                 = (known after apply)
      + template                = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = (known after apply)
      + traffic                 = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)
    }

  # google_cloud_run_v2_service.app["us-central1"] will be updated in-place
  ~ resource "google_cloud_run_v2_service" "app" {
        id                      = "projects/doug-hayden-eng-sandbox/locations/us-central1/services/agent-foundation-dev"
        name                    = "agent-foundation-dev"
        # (35 unchanged attributes hidden)

      ~ template {
            # (11 unchanged attributes hidden)

          ~ containers {
              ~ image          = "us-central1-docker.pkg.dev/doug-hayden-eng-sandbox/agent-foundation-dev/agent-foundation@sha256:bd3ee273b73a2517b69847cf2057e3ae14470621934b9b6dd7a8bd90bba8ccd4" -> "us-central1-docker.pkg.dev/doug-hayden-eng-sandbox/agent-foundation-dev/agent-foundation@sha256:c16caa1cd2a93ac29d56d6aeaa90057ae9bdd266de81757afe8a344fcbdbe492"
                name           = null
                # (6 unchanged attributes hidden)

                # (17 unchanged blocks hidden)
            }
          ~ containers {
                name           = null
                # (7 unchanged attributes hidden)

              ~ startup_probe {
                  ~ failure_threshold     = 3 -> 5
                  ~ initial_delay_seconds = 5 -> 10
                  ~ period_seconds        = 5 -> 10
                    # (1 unchanged attribute hidden)

                    # (1 unchanged block hidden)
                }

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # time_sleep.cloud_sql_ready will be created
  + resource "time_sleep" "cloud_sql_ready" {
      + create_duration = "30s"
      + id              = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ cloud_run_services                          = {
      ~ us-central1 = {
          ~ latest_ready_revision = "agent-foundation-dev-00024-29q" -> (known after apply)
          ~ update_time           = "2026-03-23T18:20:21.662921Z" -> (known after apply)
          ~ uri                   = "https://agent-foundation-dev-645mxjt3sq-uc.a.run.app" -> (known after apply)
        }
    }
  ~ deployed_image                              = "us-central1-docker.pkg.dev/doug-hayden-eng-sandbox/agent-foundation-dev/agent-foundation@sha256:bd3ee273b73a2517b69847cf2057e3ae14470621934b9b6dd7a8bd90bba8ccd4" -> "us-central1-docker.pkg.dev/doug-hayden-eng-sandbox/agent-foundation-dev/agent-foundation@sha256:c16caa1cd2a93ac29d56d6aeaa90057ae9bdd266de81757afe8a344fcbdbe492"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan-dev

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan-dev"
```

</details>

---